Конфигурация/Catalogs/ИнвестиционныеДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ИнвестиционныеДекларации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консолидирующая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМинимальноеЗначениеРейтинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЦелевоеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастиеВГолосовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнвестиционнойДекларации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовокупныйКонтроль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Базис</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазисыКонтроляИнвестиционныхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролируемыйПоказатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаМин</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаМакс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъединятьОтборы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборИнвестиционнойДекларации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыИнвестиционныхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвестиционнаяДекларация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевоеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаЦель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутреннийНабор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОпределяетСоставИСтруктуру</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСКДБазиса</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МакетКомпоновки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСКДНабора</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаЭмитентов</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяФилиалы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазовыеСтавкиОблигаций</v8:Type>
								<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
								<v8:Type>cfg:CatalogRef.Доли</v8:Type>
								<v8:Type>cfg:CatalogRef.Закладные</v8:Type>
								<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаЦенныхБумаг</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиПоказателей</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗапретаПокупки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапасМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапасМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЭмитентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Эмитенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЦенныхБумаг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазовыеСтавкиОблигаций</v8:Type>
								<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
								<v8:Type>cfg:CatalogRef.Доли</v8:Type>
								<v8:Type>cfg:CatalogRef.Закладные</v8:Type>
								<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ИнвестиционныеДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИнвестиционныеДекларации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НазначениеИнвестиционнойДекларации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеИнвестиционнойДекларации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИнвестиционнойДекларации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ТипыИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыИнвестиционныхДеклараций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛимитнаяВедомость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаконодательныеОграничения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ИнвестиционныеДекларации/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнитьОрганизацию();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ИмпортЛимитныхВедомостей") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, ТипИнвестиционнойДекларации, Комментарий, Наименование");
		
		ЭтотОбъект.СчетаДоверительногоУправления.Загрузить(ПолучитьИзВременногоХранилища(ДанныеЗаполнения.СчетаДоверительногоУправления));
		ЭтотОбъект.ГруппыЭмитентов.Загрузить(ПолучитьИзВременногоХранилища(ДанныеЗаполнения.ГруппыЭмитентов));
		ЭтотОбъект.Эмитенты.Загрузить(ПолучитьИзВременногоХранилища(ДанныеЗаполнения.Эмитенты));
		ЭтотОбъект.Показатели.Загрузить(ПолучитьИзВременногоХранилища(ДанныеЗаполнения.Показатели));
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЗаполнитьОрганизацию();
КонецПроцедуры

Процедура ЗаполнитьОрганизацию()
	Если Не ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли; 
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтотОбъект.ЭтоГруппа Тогда
		
		Для каждого СтрокаПоказатели Из ЭтотОбъект.Показатели Цикл
		
			Если Не ЗначениеЗаполнено(СтрокаПоказатели.ИдентификаторСтрокиПоказателей) Тогда
			
				СтрокаПоказатели.ИдентификаторСтрокиПоказателей = Новый УникальныйИдентификатор;
			
			КонецЕсли; 
		
		КонецЦикла; 
		
		Если ЭтотОбъект.Консолидирующая Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ИнвестиционныеДекларацииПоказатели.НомерСтроки КАК НомерСтроки,
				|	ИнвестиционныеДекларацииПоказатели.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация
				|ПОМЕСТИТЬ _Показатели
				|ИЗ
				|	&Показатели КАК ИнвестиционныеДекларацииПоказатели
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	_Показатели.НомерСтроки КАК НомерСтроки,
				|	ИСТИНА КАК Консолидирующая
				|ИЗ
				|	_Показатели КАК _Показатели
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
				|		ПО _Показатели.ИнвестиционнаяДекларация = ИнвестиционныеДекларации.Ссылка
				|			И (ИнвестиционныеДекларации.Консолидирующая)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	_Показатели.НомерСтроки,
				|	ЛОЖЬ
				|ИЗ
				|	_Показатели КАК _Показатели
				|ГДЕ
				|	_Показатели.ИнвестиционнаяДекларация = ЗНАЧЕНИЕ(Справочник.ИнвестиционныеДекларации.ПустаяСсылка)";
			
			Запрос.УстановитьПараметр("Показатели", Показатели.Выгрузить(, "НомерСтроки, ИнвестиционнаяДекларация"));
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.Консолидирующая Тогда
					ТекстОшибки = "Выбрана консолидирующая декларация в колонке ""Инвестиционная декларация"" в строке " + Выборка.НомерСтроки + " списка ""Показатели""";
				Иначе				
					ТекстОшибки = "Не запонена колонка ""Инвестиционная декларация"" в строке " + Выборка.НомерСтроки + " списка ""Показатели""";
				КонецЕсли; 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Показатели[" + (Выборка.НомерСтроки - 1) + "].ИнвестиционнаяДекларация", , Отказ);
			КонецЦикла;			
		
		КонецЕсли; 
		
		Если ЭтотОбъект.ТипИнвестиционнойДекларации <> Перечисления.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость 
			И ЭтотОбъект.СчетаДоверительногоУправления.Количество() > 0 Тогда
		
			ЭтотОбъект.СчетаДоверительногоУправления.Очистить();
		
		КонецЕсли;
		
		Если ЭтотОбъект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость Тогда
			ЭтотОбъект.СовокупныйКонтроль = Истина;
		ИначеЕсли ЭтотОбъект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация Тогда
			ЭтотОбъект.СовокупныйКонтроль = Ложь;
		КонецЕсли;
	
	КонецЕсли; 
	
	Если Не ЭтотОбъект.Ссылка.Пустая() И РедактированиеЗапрещено() Тогда
		// Это не новый объект и инвестдекларация назначена клиенту. Сравниваем версии
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ВерсияПередЗаписью", ПолучитьВерсиюОбъекта());
	
	КонецЕсли; 
	
	Если Не СтрНачинаетсяС(ЭтотОбъект.Наименование, "limits") Тогда
	
		ПроверитьУникальностьНаименования(Отказ);
	
	КонецЕсли;
	
КонецПроцедуры

Функция РедактированиеЗапрещено() Экспорт
	
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ПрограммноеОбновление") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИнвестиционныеДекларацииПоказатели.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НазначениеИнвестиционнойДекларации.ИнвестиционныеДекларации КАК НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации
			|		ПО ИнвестиционныеДекларацииПоказатели.Ссылка = НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.ИнвестиционнаяДекларация
			|			И (ИнвестиционныеДекларацииПоказатели.ИнвестиционнаяДекларация = &ИнвестиционнаяДекларация
			|				ИЛИ ИнвестиционныеДекларацииПоказатели.Ссылка = &ИнвестиционнаяДекларация)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
			|		ПО (НазначениеИнвестиционнойДекларацииИнвестиционныеДекларации.Ссылка = ИнвестиционныеДекларации.НазначениеИнвестиционнойДекларации)
			|			И (ИнвестиционныеДекларации.Активность)";
		
		Запрос.УстановитьПараметр("ИнвестиционнаяДекларация", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		УстановитьПривилегированныйРежим(Ложь);
		
		РедактированиеЗапрещено = Не РезультатЗапроса.Пустой();
		
	Иначе
		
		РедактированиеЗапрещено = Ложь;
		
	КонецЕсли;
	
	Возврат РедактированиеЗапрещено;

КонецФункции

Процедура ПриЗаписи(Отказ)
	
	// Получаем структуру результатов проверки
	РазличияВерсийОбъекта = УниверсальныеМеханизмы.ПолучитьРазличияВерсийОбъекта(ЭтотОбъект);
	
	Если Не РазличияВерсийОбъекта = Неопределено Тогда
	
		ЕстьОшибки = Ложь;
		
		Для каждого ЭлементСтруктуры Из РазличияВерсийОбъекта Цикл
		
			Если ЭлементСтруктуры.Значение.Количество() > 0 Тогда
			    // Есть отличия в ключевых реквизитах объекта
				ЕстьОшибки = Истина;
				Прервать;		
			КонецЕсли; 
		
		КонецЦикла; 
		
		Если ЕстьОшибки Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Инвестиционная декларация назначена клиенту", ЭтотОбъект, , , Отказ);
		
		КонецЕсли;
	
	КонецЕсли; 
		
КонецПроцедуры

// Возвращает структуру: 
// Ключ - идентификатор набора контролируемых реквизитов
// Значение - Таблица значений. Колонки таблицы - проверяемые реквизиты
Функция ПолучитьВерсиюОбъекта() Экспорт

	ВерсияОбъекта = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларации.ПометкаУдаления КАК ПометкаУдаления,
		|	ИнвестиционныеДекларации.Организация КАК Организация,
		|	ИнвестиционныеДекларации.Консолидирующая КАК Консолидирующая,
		|	ИнвестиционныеДекларации.ТипИнвестиционнойДекларации КАК ТипИнвестиционнойДекларации,
		|	ИнвестиционныеДекларации.СовокупныйКонтроль КАК СовокупныйКонтроль
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
		|ГДЕ
		|	ИнвестиционныеДекларации.Ссылка = &Ссылка";
	ВерсияОбъекта.Вставить("Реквизиты", Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииПоказатели.Базис КАК Базис,
		|	ИнвестиционныеДекларацииПоказатели.КонтролируемыйПоказатель КАК КонтролируемыйПоказатель,
		|	ИнвестиционныеДекларацииПоказатели.МинимальноеЗначение КАК МинимальноеЗначение,
		|	ИнвестиционныеДекларацииПоказатели.МаксимальноеЗначение КАК МаксимальноеЗначение,
		|	ИнвестиционныеДекларацииПоказатели.АбсолютнаяВеличинаМин КАК АбсолютнаяВеличинаМин,
		|	ИнвестиционныеДекларацииПоказатели.АбсолютнаяВеличинаМакс КАК АбсолютнаяВеличинаМакс,
		|	ИнвестиционныеДекларацииПоказатели.ОбъединятьОтборы КАК ОбъединятьОтборы,
		|	ИнвестиционныеДекларацииПоказатели.НаборИнвестиционнойДекларации КАК НаборИнвестиционнойДекларации,
		|	ИнвестиционныеДекларацииПоказатели.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация,
		|	ИнвестиционныеДекларацииПоказатели.ВнутреннийНабор КАК ВнутреннийНабор,
		|	ИнвестиционныеДекларацииПоказатели.ОпределяетСоставИСтруктуру КАК ОпределяетСоставИСтруктуру,
		|	ИнвестиционныеДекларацииПоказатели.Эмитент КАК Эмитент,
		|	ИнвестиционныеДекларацииПоказатели.ГруппаЭмитентов КАК ГруппаЭмитентов,
		|	ИнвестиционныеДекларацииПоказатели.ВключаяФилиалы КАК ВключаяФилиалы,
		|	ИнвестиционныеДекларацииПоказатели.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ИнвестиционныеДекларацииПоказатели.ГруппаЦенныхБумаг КАК ГруппаЦенныхБумаг,
		|	ИнвестиционныеДекларацииПоказатели.ДатаЗапретаПокупки КАК ДатаЗапретаПокупки
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
		|ГДЕ
		|	ИнвестиционныеДекларацииПоказатели.Ссылка = &Ссылка";
	
	ВерсияОбъекта.Вставить("Показатели", Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииЭмитенты.Группа КАК Группа,
		|	ИнвестиционныеДекларацииЭмитенты.Эмитент КАК Эмитент
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.Эмитенты КАК ИнвестиционныеДекларацииЭмитенты
		|ГДЕ
		|	ИнвестиционныеДекларацииЭмитенты.Ссылка = &Ссылка";
	
	ВерсияОбъекта.Вставить("Эмитенты", Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииЦенныеБумаги.Группа КАК Группа,
		|	ИнвестиционныеДекларацииЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.ЦенныеБумаги КАК ИнвестиционныеДекларацииЦенныеБумаги
		|ГДЕ
		|	ИнвестиционныеДекларацииЦенныеБумаги.Ссылка = &Ссылка";
	
	ВерсияОбъекта.Вставить("ЦенныеБумаги", Запрос.Выполнить().Выгрузить());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииСчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.СчетаДоверительногоУправления КАК ИнвестиционныеДекларацииСчетаДоверительногоУправления
		|ГДЕ
		|	ИнвестиционныеДекларацииСчетаДоверительногоУправления.Ссылка = &Ссылка";
	
	ВерсияОбъекта.Вставить("СчетаДоверительногоУправления", Запрос.Выполнить().Выгрузить());
	
	Возврат ВерсияОбъекта;

КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ЛимитнаяВедомость Тогда
		ПроверяемыеРеквизиты.Добавить("СчетаДоверительногоУправления");
	ИначеЕсли ЭтотОбъект.ТипИнвестиционнойДекларации = Перечисления.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация Тогда
		ПроверяемыеРеквизиты.Добавить("УчастиеВГолосовании");
	КонецЕсли; 
	
КонецПроцедуры
 
Процедура ПроверитьУникальностьНаименования(Отказ)

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации КАК ИнвестиционныеДекларации
		|ГДЕ
		|	ИнвестиционныеДекларации.Ссылка <> &Ссылка
		|	И ИнвестиционныеДекларации.Наименование = &Наименование
		|	И ИнвестиционныеДекларации.Организация = &Организация";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наименование инвестиционной декларации неуникально", ЭтотОбъект, "Наименование",, Отказ);
	
	КонецЕсли;

КонецПроцедуры
